tenbaht/sduino/sduino/hardware/sduino/stm8/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

stm8sblue.name=STM8S103F3 Breakout Board

stm8sblue.upload.using=stm8flash
stm8sblue.upload.protocol=stlinkv2
stm8sblue.upload.mcu=stm8s103?3
stm8sblue.upload.maximum_size=8192

stm8sblue.build.mcu=STM8S103
stm8sblue.build.f_cpu=16000000L
stm8sblue.build.core=sduino
stm8sblue.build.variant=standard

# meaningless variables just to keep the makefile happy

stm8sblue.upload.speed=1
